{
    "csse": [
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-1-1245",
            "title": "Making PowerApps",
            "studentName": "David Tkach",
            "studentMajor": "CSSE",
            "projectType": "Internship - Premera Blue Cross",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/tkach_david.png",
            "abstract": "My sponsor, Premera Blue Cross, is an insurance company committed to making healtchcare work better for their members. Eric Valpey and John Hauser are my mentors. Eric is an actuary who developed the original Leaderboard app, and John is my manager. My work involves using Microsoft Power Platform to build a new app to maintain the Leaderboard list in SharePoint.\n\nMacros are used in the existing Leaderboard system, which creates a security risk. Maintaining the system is difficult and it could only be run on-site. This is an issue since the system is storing time-sensitive information and the current status of certain items must be known.\n\nTo resolve these issues, a new application will be developed where different users could perform all their tasks in one place. Users will have a convenient interface to provide updates on all of their items. They can subscribe to areas of interest and see who is subscribed to them. Meetings could also be started in the app where members could see the items while they are being discussed.\n\n During my internship, the contributions I am especially proud of consist of the following four items. First, a Weekly Update screen which allows users to see all their items, edit them in one place and notify their subscribers. Second, I developed a mechanism for emailing updates based on the user’s notification preferences: immediate or nightly. Third, when a new meeting starts, a tile view shows an overview of the items on the agenda. Fourth, a meeting screen allows members to discuss the status of important items.\n\n One of the most challenging issues I encountered was a duplication bug where multiple copies of an item were being written to a SharePoint list. This bug was interesting since I thought it was caused when the user’s subscription preferences were saved. Later, I learned the importance of writing test cases and was able to fix this issue when I discovered it was actually caused when data was being loaded from persistent storage. I also learned the importance of revisiting previous solutions. One example was the re-visiting of the solutions to the notification flows where the functionality was modularized into re-usable components to improve scalability. To wrap up, I really enjoyed improving the program over time and seeing it grow."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-1-100",
            "title": "CSS497 Capstone Project: SDE Internsip with Expedia",
            "studentName": "Christopher Marvelle",
            "studentMajor": "CSSE",
            "projectType": "Internship - Expedia",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/marvelle_christopher_mathew.png",
            "abstract": "As a major travel site and platform provider Expedia is constantly pushing to improve their systems and to allow for the customers to feel welcome across all platforms. During my internship at Expedia in Summer 2022, my team focused on updating the loyalty user experience. Currently, customers must create separate accounts for Expedia, all partner sites and platform services. This leads to customers only returning to sites “as needed” or when deals benefit them leading to customer rewards tend to go to waste. The goal of my team’s project is to provide a single login experience where your rewards points are available anywhere inside the Expedia Ecosystem and to provide a richer user experience that simplifies using those points. \n\nPrior to contributing to this project, I spent my first two weeks in onboarding to learn what systems my team uses and how we are shifting from a legacy system. The main challenges at this time were getting up to speed with terminology but also recognizing how to phrase my questions in a way that my mentors and manager could understand where I was at knowledge-wise. \n\nMy work on this project was focusing on a creating a new React component and tying it together our new backend services. With this component customers will be presented with campaigns that show current offers and discounts that when clicked will award logged in users with reward points as thanks for their engagement.\n\nAs part of this project, I created new React components for our UI then added a query and mutation to an existing API using GraphQL and Kotlin. The primary challenges here were not only learning the new technologies required to develop these items but finding and creating the documentation so that the poor soul after me will understand the design choices and services used.\n\nAs part of my internship, I spent a considerable amount of time in lectures with Expedia leadership. During these lectures we learned about Expedia and its view for the future while also learning about important soft skills needed to succeed in the workforce. \n\nOverall, my experience at Expedia was amazing. My team welcomed me in and went well out of their way to make sure that I able to contribute. I learned how to develop in an enterprise environment and how to efficiently ask questions to get the information that I need without having to answer clarifying questions."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-1-115",
            "title": "CourseXpo: Teaching with Collaborative Drawing",
            "studentName": "Talon Martin",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/martin_talon.PNG",
            "abstract": "Current digital learning tools, such as Zoom or Canvas, have shaped the way the modern classroom is run. The recent pandemic has exposed the need for fully remote or hybrid learning environments; current implementations of these have many avenues by which they can be improved or expanded upon. Remote courses often suffer from a lost sense of classroom community, stemming from three areas: a lack of immersion, a lack of engagement, and a lack of potential for collaboration.\n\nDuring this Capstone, my team members and I sought to address the above problems through the continued development of the CourseXpo program, in which we were tasked with reimagining the future classroom. This program was created by UWB students as part of a Capstone last quarter and utilizes the Augmented Space Library developed by previous UWB students.\n\nThe project workflow consisted of agile software development in a small team. My group members and I worked throughout the week as developers and testers of new features that were proposed by us or by the faculty advisor. We held meetings twice a week where we presented our progress and proposed the next work to be completed. Care was taken to outline goals in advance through the creation of user stories and milestones to which we were held accountable. Our goals as a team were to expand upon the strengths of CourseXpo while addressing the aforementioned problems with virtual learning spaces. \n\nTo accomplish immersion, we implemented voice chat and added audio in areas that were lacking. To accomplish engagement, we experimented with expanding virtual avatar customization. To accomplish collaboration, we designed drawing canvas tables for teachers and students. Our solutions were evaluated by our team along with UWB faculty as clients. Our intent behind each of these solutions was derived from the needs of teachers and students in an educational setting – we were constantly evaluating and exploring this throughout our development. For all of these features, I was heavily involved in the creative process, technical implementation, testing, and feedback analysis.\n\nThis Capstone gave me experience working with a motivated team and with an existing code base. I also built work skills like time management, goal setting, and communication with a manager/advisor. Our work has implications for future faculty research on systems development and digital learning. The CourseXpo program may continue to see development as faculty advisors see fit."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-1-130",
            "title": "CourseXpo: A Collaborative Virtual Learning Environment",
            "studentName": "Paul White",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/white_paul.png",
            "abstract": "The problems at hand are what might a digital classroom look like and how users would interact in such a classroom. My team was tasked with improving and expanding the functionality that had been previously explored by my predecessors. The existing framework consisted of a digital expo hall with individual booths as lessons, some of these booths were designed to support assignments and quizzes. Communication within this digital expo hall was handled through text chat and announcements made by the Teacher user. We deemed that current existing functionality lacked a level of collaboration that we felt was necessary in a classroom environment and decided to improve upon the collaboration aspect of the system.\n\n To improve the collaboration within the prototype we have implemented support for users to be able to communicate with each other via voice chat that would be appear seamless to the end user. The users are able to interact with each other through a shared drawing canvas. Users can also work through assessments together and have a shared experience. The primary goals and intentions are to ensure that the user have a shared user experience similar to what they might have in a physical classroom without the constraints of the physical world. \n\nThe current prototype demonstrates interactions that users may have within a virtual learning environment. These interactions let us create new user stories and explore additional functionality that can be improved upon. As such, the current prototype has identified issues that would likely prevent it from being used in a class setting, such as how an instructor would upload a custom lesson plan. The current implementation does not allow an instructor to custom tailor a lesson plan but currently requires the lesson plan to fit a rigid outline. As such it is difficult to incorporate new lessons without having to modify the existing expo to accommodate a new lesson plan. We believe that the prototype has demonstrated the potential baseline functionalities and interactions within a virtual learning environment. The next steps would be to improve booth creation at runtime from a teacher created lesson, to identify and define membership roles such as teacher and student, and to continue to improve the virtual reality experience for the end user."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-1-145",
            "title": "Touching Functions: A Collaborative Virtual Graphing Engine",
            "studentName": "Khushaal Kurswani",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/kurswani_khushaal_kamal.jpg",
            "abstract": "The goal of this capstone, as a part of the Cross Reality Collaboration Sandbox Research Group, was to develop a 3D graphing calculator application using the Unity game engine to provide students an engaging way to learn about mathematical functions and experience them in a 3D space.\n\nCurrent remote learning methods such as Zoom lectures leads to minimal student participation and fails to engage students in the course content. Mathematics is especially difficult teach remotely because virtual mediums are unable to support the required face-to-face interaction and hands-on learning practices.\n\nThis project seeks to alleviate some of the problems associated with remote learning by providing a tool that can be used to explore mathematical functions and their properties in an immersive virtual environment. The application allows users to graph several functions simultaneously and view the graphed functions’ properties such as the domain, range, and derivatives. Users can further explore the graphed functions by flying around and by walking or riding roller coasters on the graphed functions. Users can also change the size of their in-game avatars to view the graph from different perspectives. Each user can further customize their own in-game avatar and interact with other users’ avatars while in this virtual world.\n\nThis project was split amongst four people and everyone’s individual contributions culminated into the final product. My contribution was designing the graph axes and developing its manipulation functionality. Through this functionality, users can manipulate the length, the interval increments, and the space between intervals of each graph axis. In addition, I developed the flying and avatar size changing features in the application.\n\nOur group received feedback from Professors Kelvin Sung and Robin Angotti on a weekly basis to ensure that the application supported features required for teaching mathematical concepts. Furthermore, play testers found the application to be engaging and increased their curiosity about the graphed functions based on the results of the feedback surveys that each play tester filled out.\n\nThrough this project, I got to experience several software development lifecycle stages. One of the most important stages was getting regular user feedback since it helped us develop an application that would be useful to the end user. Prototyping new functionality while getting constant feedback is quite helpful as it provides the end-user with an understanding about what functionality is possible and provides developers a clear idea about the functionality’s feasibility."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-1-200",
            "title": "Touching Functions: A Collaborative Virtual Graphing Engine",
            "studentName": "Edward Liao",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/liao_edward.png",
            "abstract": "The goal of this project is three-folds: solve the problem of lack of engagement in the current mathematical graphing software and learning environments, use Augmented Space Library (ASL) developed by Cross Reality Collaboration Sandbox Research Group to build a collaborative application, and take advantage of the Virtual Reality (VR) technology to build a virtual environment for students to engage in learning about mathematical functions.\n\nWorking as part of a team of four developers, we designed a solution to the above problem, consists of three parts - Firstly, support interesting graphical objects and gameplay to improve student engagement. Secondly, include a synchronized graphing interface to facilitate collaborative learning. Finally, deliver a uniform experience for both VR and PC users to allow students from both platforms to collaborate at the same time.\n\nThere were many challenges to this project: One of them is Unity does not have an existing solution to communicate with the WolframAlpha API. I was able to find a third-party NuGet package that performs this functionality and integrate it into our project, ensuring the core of the project performs with no issue. I was also responsible for designing a standardized way for Unity gameObjects to communicate within the ASL network, saving my team time to read through all the documentation.\n\nThe result of the project was a learning application running on Unity that is accessible from both PC and VR. Within the application, students can interact with each other through personalized avatars, while collaborating on a graph canvas that is shared with all students. Students can see and explore the graph representation of their mathematical functions of choice.\n\nThrough working on this project, I was able to learn both soft and hard skills that will proof to be useful in my future career. For hard skills, I learned about peer-to-peer networking system through ASL. I also learned to utilize, consume, and integrate public APIs in our own project. The soft skills I learned include how to communicate with and adapt the project to the needs of stakeholders, and how to collaborate with other developers to finish a non-trivial project. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-1-215",
            "title": "Touching Functions: A Collaborative Virtual Graphing Engine",
            "studentName": "Daniel Lorentz",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/lorentz_daniel.PNG",
            "abstract": "The traditional ways of graphing mathematical functions in 2D restrict the understanding and learning of the challenging concepts in the abstract. An approach to overcome the abstract is by supporting an immersive solution for interacting and engaging with the functions as physical objects, to examine the details, why they are useful, and how they can describe the real world through virtual reality. \n\nAs a team, we designed and developed a Unity-based project to present the immersive virtual world for learning. In such an environment,  a comprehensive user interface and a virtual keyboard for both PC and VR users is important for interacting with the world. \n\nAs a team of 4, we built an immersive first person 3D plotting system that supports both remote VR and PC users to collaboratively explore functions. My contributions to this system was implementing all of the VR controls and creating the user interface with a virtual keyboard. For the VR controls, I needed to adapt the functionality developed by my teammates such that they would operate in a VR environment. In particular, I must virtualize the physical keyboard and customize the user interface designed for PC users into a single coherent and functional system for VR users.\n\nThe virtual keyboard was developed through an iterative process where I would articulate a design to receive feedback that would be incorporated in the subsequent design. Developing the user interface involved gathering ideas for an appropriate layout, creating the initial design, and integrating user feedback into future designs. The end result of the virtual keyboard and user interface went through two separate rounds of explicit end user testing of the functionality, where the feedback indicated that the design was robust and unobtrusive, allowing the users to become immersed in the world. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-1-230",
            "title": "Touching Functions: A Collaborative Virtual Graphing Engine",
            "studentName": "Ethan Mo",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/mo_ethan.jpg",
            "abstract": "Math can be intimidating. Math learners, especially the younger ones, tend to be easily discouraged by the complicated concepts. When teachers demonstrate the function graphs, students are not offered much opportunities for interaction with the graph other than staring at a still image, putting limitation on their engagement and thus the learning outcomes. In addition, with remote learning becoming more mainstream, a tool to boost collaboration while learning math becomes important. Touching Function is a modernized graphing engine that aids students and teachers in studying algebra, trigonometry and calculus, in a more immersive environment. \n\nTouching Function uses Unity to create a 3D scene for users to explore in a first-person perspective using either PC or VR. This allows the users to navigate around the coordinate systems using the controls similar to their favorite videogames, those that they are likely already familiar with. The multi-player aspect is made possible using the Augmented Space Library developed by the Cross Reality Collaboration Sandbox (CRCS) Research Group, to allow world synchronization between all players. The project also uses Wolfram Alpha API to generate detailed Function information, in order to plot the graphs and display the associated attributes. \n\nThe project team consists of four members, with each one of us responsible for a few functionalities during the development period. During the daily standup meeting in the morning, we would determine each one’s task and deliver time, and update the progress with the rest of the team during the evening meeting. I was responsible for implementing the graph meshes, player movement and customization, avatar animation, and the roller coaster features.\n\nBy the end of the development period, the app allows multiple users to create, modify and examine function graphs simultaneously. The app extends learning by allowing users to manipulate the axes and examine the change in the graphs. It also makes math learning more engaging by allowing users to walk, slide and riding a roller coaster on any of the function graph they create. The app offers a new way to learn math, and will provide a foundation for any future work to take place."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-1-245",
            "title": "Digital Plumbing @ Second Spectrum",
            "studentName": "Scarlett Halima",
            "studentMajor": "CSSE",
            "projectType": "Internship - Second Spectrum",
            "facultyAdvisor": "Dr. Brent Lagesse",
            "posterLink": "./posters/csse/halima_scarlett_gusti.png",
            "abstract": "My capstone project is a sponsored internship with the Los Angeles based sports analytics company called Second Spectrum. Within my time as an intern, I joined the infrastructure team which is responsible for designing, building, deploying, and maintaining how our software is released to either cloud or on-premise servers. \n\nMy main project as an infrastructure engineer intern is to replace an existing continuous integration (CI) tool called Tanka to a newer one called ArgoCD. The main purpose of making this transition is because ArgoCD offers a lot more features and a simpler process to deploy applications.\n\nContinuous integration (CI) is the process of how code changes from different applications are released. Some of the goals of having a planned process for handling the CI is to make sure that new changes from the software are released without any conflicts, able to monitor if the deployment is successful or not, and to be able to audit changes or move back to a previous version of the software if needed.\n\nBefore I was able to migrate our CI process from Tanka to ArgoCD, I needed to understand the fundamentals of other related technologies and concepts that goes along with how deployments are done within the company. This includes having the need to understand the different services we use in Amazon Web Services, Docker as an operating-system container virtualization, and Kubernetes as the container’s orchestrator.\n\nBy the time of my capstone presentation, I have managed to deploy different applications using ArgoCD. But because the deployed applications in ArgoCD have different configurations, the process of migrating applications involves understanding the basics of what the application does, compiling questions to resolve ambiguous situations, and testing the deployment in a Kubernetes cluster.\n\nIn summary, the goal of my internship is to migrate our continuous integration process to ArgoCD which was successfully done by having an understanding of infrastructure fundamentals and being able to plan around ambiguous requirements. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-1-300",
            "title": "FHE Video Sharing 2.0",
            "studentName": "Jakob Hoveland",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Brent Lagesse",
            "posterLink": "./posters/csse/hoveland_jakob.JPG",
            "abstract": "For my project I worked on taking a project developed by some of professor Lagesse’s previous students and updating it to work with the many changes made to the different libraries that it uses. The project is a video sharing app that uses encryption to make sending the videos safer and an algorithm to determine if the video is sufficiently similar enough to the videos they possess.\n\n It had been several years since this project was updated to work with the libraries it uses, especially Microsoft’s SEAL, so a lot of work needed to be done to fix it. The project is important as it could help to provide more security to the act of sharing videos with others and ensuring the authenticity of the person you are attempting to share with. The updates I provided helped to bring the app closer to helping more people.\n\nThe result of my work is that the app runs. It can properly share the videos, but the algorithm for determining the similarities of the videos is not working properly. More work will need to be done to get the algorithm to work as it should.\n\nThe significance of what was done is that it brings this app one step closer to being fully operational. There is still a lot more work to be done to fix it and add in all of the needed features, but having it run, even if not entirely as it should, is a big step forward in the work it needs."
        }                  
    ]
}